Question 1

In [6]:
import pandas as pd
series = pd.Series([4,18,15,16,23,42])

In [8]:
print(series)
type(series)

0     4
1    18
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

Question 2

In [11]:
list = [12,45,67,32,34,55,32,22,56,22]
print(pandas.Series(list))

0    12
1    45
2    67
3    32
4    34
5    55
6    32
7    22
8    56
9    22
dtype: int64

Question 3

In [14]:
data = {'Name':['Alice', 'Bob', 'Claire'], 'Age':[25, 30, 27], 'Gender':['Female', 'Male', 'Female']}
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Question 4

DataFrame is a two dimensional structure in which every row has their own index value.

Example :-

In [16]:
example = {"Emp_Id": [101, 102, 103], "Emp_Name":["John", "Andrew", "Luke"]}
df_example = pd.DataFrame(example)
print(df_example)

   Emp_Id Emp_Name
0     101     John
1     102   Andrew
2     103     Luke

As we can see in the above structure each row has a index.

Series is the data structure in python which is one dimensional whereas pandas is two dimensional structure.

Example of Series :-

In [19]:
list = ['s1', 's2', 's3', 's4', 's5', 's6']
series_eg = pd.Series(list)
print(series_eg)
print(type(series_eg))

0    s1
1    s2
2    s3
3    s4
4    s5
5    s6
dtype: object
<class 'pandas.core.series.Series'>

Question 5

In [27]:
data = {"Name":['Abhishek', 'Adarsh', 'Anamika'], "Roll_No":[10001, 10002, 1003], "Class": ['X',"XII", 'XI']}
data_frame = pd.DataFrame(data)
print(data_frame)

       Name  Roll_No Class
0  Abhishek    10001     X
1    Adarsh    10002   XII
2   Anamika     1003    XI

Common functions to manipulate data in Pandas DataFrame

In [28]:
data_frame.columns # For printing columns

Index(['Name', 'Roll_No', 'Class'], dtype='object')

In [36]:
data_frame.head(1) # For printing uppermost row

       Name  Roll_No Class
0  Abhishek    10001     X

In [37]:
data_frame.tail(1) # For printing last row

      Name  Roll_No Class
2  Anamika     1003    XI

In [38]:
data_frame["Roll_No"] # For printing one column

0    10001
1    10002
2     1003
Name: Roll_No, dtype: int64

In [39]:
data_frame[["Name","Class"]] # For printing multiple columns

       Name Class
0  Abhishek     X
1    Adarsh   XII
2   Anamika    XI

In [40]:
data_frame.dtypes # For printing data type of columns

Name       object
Roll_No     int64
Class      object
dtype: object

Question 6

DataFrame and Panel are mutable in nature while Series is immutable.

Question 7

In [49]:
l1 = ["Shop_ID", "Shop_location", "Shop_Name"]
l2 = [302, "New_Delhi", "Vansh_Jeweller"]
l3 = [303, "Lucknow", "Vimal_Traders"]
l4 = [304, "Hyderabad", "Gautam_Brothers"]
s1 = pd.Series(l1) # Creating first series
s2 = pd.Series(l2) # Creating second series
s3 = pd.Series(l3) # Creating third series
s4 = pd.Series(l4) # Creating fourth series
print(type(s1))
print(type(s2))
print(type(s3))
print(type(s4))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [46]:
data1 = s1,s2,s3,s4 # Putting all series in single variable

In [47]:
df1 = pd.DataFrame(data1) # Creating DataFrame

In [50]:
print(df1) # Printing DataFrame

         0              1                2
0  Shop_ID  Shop_location        Shop_Name
1      302      New_Delhi   Vansh_Jeweller
2      303        Lucknow    Vimal_Traders
3      304      Hyderabad  Gautam_Brothers